{
        "album": {
                "title": "ARIZONA Baby",
                "artist": "Kevin Abstract",
                "emojiCode": "2692",
                "emojiName": "Tools",
                "score": "7.0",
                "albumArt": "arizona-baby.jpg"

        },
        "review": {
                "author": "Jon Martin",
                "date": "April 11th, 2019",
                "overview": "ARIZONA baby is the first installment in a series of short EPs released by Kevin Abstract, the leader and a founding member of popular boy band BROCKHAMPTON. With his first solo album releasing in 2014 and his second solo record releasing in 2016, this marks his first individual project since BROCKHAMPTON’s rise to stardom. Even with ARIZONA baby’s brevity, it is still incredibly clear how much Abstract has grown as an artist with his time spent on the BROCKHAMPTON projects the SATURATION trilogy and iridescence. With BROCKHAMPTON in-house producer Romil Hemnani and Jack Antonoff behind the production of all three tracks, the beats are intricate, elaborate and diverse. Abstract tackles a lot of intense and introspective topics in the time span of eight minutes and fifty-three seconds and lays his soul bare through some of his regrets in life. The amazing vocal mixing and the occasional use of auto-tune takes the listener back to some of the highlights from the SATURATION trilogy and Abstract remains a beautiful chorus performer. Overall, considering its length, ARIZONA baby is worth at least a quick listen and many listeners will be pleasantly surprised by how infectious some of the beats and choruses are.",
                "songs": {
                        "song1": {
                                "name": "Big Wheels",
                                "lyrics": "https://genius.com/Kevin-abstract-big-wheels-lyrics",
                                "desc": "First and foremost, this track originally appeared on BROCKHAMPTON’s YouTube channel under a video titled “THE 1-9-9-9 IS COMING” as a teaser for this project. The production on this track is extremely layered and sounds almost delicate with how precisely everything is placed. The bass is powerful while the melody is high-pitched and sounds almost eery due to its stark contrast with the booming bass. The snare adds a wonderful touch of tempo and the latter half of the track / instrumental outro sounds downright sexy. While the production on this track is amazing, Abstract’s verse is nothing to scoff at. While the lines “Y'all pump fakin' / I'm a power bottom like a Free Mason / Y'all stuck playin', that's complacent, I'm cum-chasin'” are a clear comedic standout, Abstract still gets some intense things off of his chest in only a handful of bars. His mother still works at Sonic. He regrets missing out on college to pursue his music career. His friends back home question the validity of his sexuality. All of these thoughts and more are dropped unto the listener on a track that is less than two minutes long with half of it being an instrumental! Every aspect of this track is stellar and no part of it lags behind the rest, with the only complaint being it should have been longer.",
                                "extra": "standout"
                        },
                        "song2": {
                            "name": "Joy Ride",
                            "lyrics": "https://genius.com/Kevin-abstract-joy-ride-lyrics",
                            "desc": "In typical BROCKHAMPTON fashion, Abstract is not one to remain on a particular sound for long. Immediately, the listener can tell this sounds drastically different compared to the first track with a set of horns roaring in instantly at the start of the track. This is a track where Abstract’s ability to sing a hook really shines and the phenomenal vocal mixing really shows. The use of pitched up vocals during the pre-chorus sounds almost Kanye-esque and Abstract’s rebellious chorus is catchy. Abstract tackles how fame has changed him with his verses along with glimpses of some of his darker thoughts with lines like “How do you cope without a rope?” This sounds almost ironic with the upbeat and energetic production but is definitely more than a solid track, even with the odd but probably intentional thematic clash of production and lyricism.",
                            "extra": "standout"
                        },
                        "song3": {
                            "name": "Georgia",
                            "lyrics": "https://genius.com/Kevin-abstract-georgia-lyrics",
                            "desc": "The vocal mixing of the chorus in conjunction with the guitar sound incredibly pretty and while the beat is a lot more subtle than the other two tracks, short of the guitar, it is by no means lacking. This song was definitely set up to highlight the beautiful chorus, and it does this in a spectacular fashion. The verses jump from a wide array of subjects: from guns in schools, to fear of coming out, to awe at how far his career has come, to self-love but unfortunately do not delve very deeply into any of them aside from a single line or two at most. In fact, that’s probably the biggest critique that can be had of this album is both the brevity in its length and brevity in how deeply it delves into deeper concepts.",
                            "extra": "standout"
                        }
                },
                "summary": "This EP, while short, shows a lot of promise for the rest of Kevin Abstract’s subsequent solo projects coming. The production remains incredibly advanced throughout all three tracks with a laundry list of sounds used and impeccable placement of said sounds. The choruses were well delivered and Abstract does not slack on the subject matter of his verses. With intense topics ranging from fame, fear of coming out, and even guns in schools, there isn’t much this project is lacking. One thing that is somewhat upsetting is how little fleshed out these brief dips into deeper subject matter were. They remain flashes in the pan stranded in the middle of verses, but Abstract does not delve very deeply into exploring some of his more intense topics. The lack of content of the project is also obviously a problem, and it doesn’t seem like there is a consistency to the theme or sound of the EP. Sticking to a formulaic sound or theme was never BROCKHAMPTON’s style and Abstract keeps it diverse on this EP as well. Unfortunately, that leads to this EP feeling like a collection of singles, but even given that, they are still very good singles. As for the arbitrary rating metric of tools, this one is a bit more of a stretch but in the comedic bars previously referenced in “Big Wheels,” Abstract compares himself as a power bottom to the fraternal organization the Freemasons. The origin of the Freemasons can be traced to local fraternities of stonemasons, who used tools regularly, which used to regulate the qualifications of stonemasons and their interaction with authorities and clients. Yeah, it’s a bit of a stretch."
        }
}
