{
    "album": {
        "title": "Ventura",
        "artist": "Anderson .Paak",
        "emojiCode": "1F601",
        "emojiName": "Teefs",
        "score": "8.0",
        "albumArt": "ventura.jpg"

    },
    "review": {
        "author": "Jon Martin",
        "date": "April 15th, 2019",
        "overview": "Less than half a year ago, Anderson .Paak released his first studio album in two years titled Oxnard, named after his hometown. Oxnard marked a shift away from the soul and R&B sound he masterfully crafted in his first two projects, Venice and Malibu, towards a more rap heavy, tighter and processed project. Unfortunately, this shift was not for the better as .Paak’s rapping skills aren’t quite up to snuff in comparison to his skills as a singer, and the reduced critical acclaim and poor public reception of the project, compared to Malibu, made that clear. Funnily enough, .Paak’s mother took to defending him on social media, but it remains pretty clear that Oxnard was a step back from the phenomenal Malibu. While Malibu highlighted his vocal capabilities, .Paak sounds stuffy and constrained on Oxnard, lacking the sense of almost organic ease of delivery he had on his previous projects. Fortunately, Ventura represents a return to form for .Paak as he takes the listener back to the sound he refined on Malibu. While Ventura and Oxnard were recorded simultaneously, Ventura sounds almost effortless in comparison as he skates across funky instrumentals with beautifully sung choruses that emphasize the flexibility of his voice. Even .Paak himself sounds like he is having a ton of fun recording this project, as he skirts from humorous verses with hilarious premises to serious subjects and back at the flip of a track. Plenty of these tracks could be seamlessly weaved into Malibu without the listener ever batting an eye, which is ultimately where this album’s primary weaknesses stem from. For listeners wanting more Malibu, this project will quench that thirst, but for listeners wanting .Paak to branch out into more adventurous territory, akin to Oxnard, this will not be the project for them. Another weakness of Ventura is the uniformity of the project. While Malibu had some songs that were clearly stronger than others, Ventura has less of a disparity in song strength and it seems like the album’s highs aren’t quite as high as Malibu’s. The instrumentals have a tendency to run a little long across this project as a whole, with the occasional extended gap without a single spoken word. While Malibu seems to have stricken that perfect balance between strong instrumentals with choruses and verses weaved in, Ventura seems to have just barely missed that sweet spot, skewing towards longer instrumental intros and outros. Even with these weaknesses, however, this album is still an absolute pleasure to listen to and there are certainly worse flaws than lack of diversity when the starting point is something as well-crafted as Malibu. If it ain’t broke, don’t fix it. It seems like .Paak has taken that to heart to give his fans what they wanted with Ventura, and it’s a real treat.",
        "songs": {
            "song1": {
                "name": "Come Home (feat. André 3000)",
                "lyrics": "https://genius.com/Anderson-paak-come-home-lyrics",
                "desc": "Anderson .Paak definitely made a conscious choice to lead on the André 3000 feature and that conscious choice saves everyone the trouble of having to skip directly to this track for a listen. .Paak’s singing remains a joy to listen to as he delivers the chorus with his iconic and familiar raspy tone. The choir used for the refrain and to highlight his vocals in the chorus is a nice touch in conjunction with the elaborate but fitting instrumental. With a solid drumline and incredibly wide array of instruments used, the instrumental builds an almost jungle-like atmosphere through rattling tambourines and oscillating drums. André 3000’s sharp delivery of his verse is a stark contrast to the smooth and rolling delivery of .Paak’s chorus and with rhymes like “A phenomenon, come with me / Like it's Ramadan, I don't eat / Like it's Comic Con” it remains a mystery if 3 Stacks will ever deliver a lackluster feature.",
                "extra": "standout"
            },
            "song2": {
                "name": "Make It Better (Ft. Smokey Robinson)",
                "lyrics": "https://genius.com/Anderson-paak-make-it-better-lyrics",
                "desc": "Despite being the second single released in promotion of this album, this track is largely unremarkable. It is a solid track, and it is certainly not a bad one. But while .Paak’s delivery remains silky smooth as always, this track doesn’t do much to pop or stand out in a sea of similar sounding tracks that do a little more to differentiate themselves from the crowd of .Paak’s discography. Instrumentally, the violins sound beautiful and the bassline is snappy, however that can be said about almost every song on this album. While this track is sound, it isn’t very unique in comparison to the rest of the project."
            },
            "song3": {
                "name": "Reachin' 2 Much (Ft. Lalah Hathaway)",
                "lyrics": "https://genius.com/Anderson-paak-reachin-2-much-lyrics",
                "desc": "This track was reaching for too much. At five minutes and fifty-six seconds, this track is over three times longer than the shortest track on this project and over a minute longer than the second longest track on this project. With a grand total of two verses split across two different beats, this track feels like two different instrumentals with the SAME chorus lazily thrown across it. What is even more unfortunate is that this song doesn’t actually sound that bad aside from suffering from the issues of the previous track and not sounding particularly unique. If this track was cut off at the beat switch, regardless of which beat was kept, and both verses were squeezed in, it would probably remain unremarkable but not necessarily the grueling marathon it currently is.",
                "extra": "avoid"
            },
            "song4": {
                "name": "Winners Circle",
                "lyrics": "https://genius.com/Anderson-paak-winners-circle-lyrics",
                "desc": "This track is one that puts Anderson .Paak in the winner’s circle. With an absolutely bumpin bass, a smooth chorus featuring an infectious acapella adlib, and some of the best rapping .Paak has ever delivered on a studio album, this track has a ton going for it. .Paak’s rapping in the first half of the track is timely, akin to a slower version of André 3000’s verse on the first track and his delivery on the second half of the track when he goes “in deep” is phenomenal. The gem of a line “When I get the gushy, I go dumb like the President / Yes, lawd, I'm way up, word to Sacagawea / If the gushy was a sneaker, it'd be moccasin trainer” makes its appearance here and the piano trill in the background is a beautiful touch to close out this stellar track.",
                "extra": "standout"
            },
            "song5": {
                "name": "Good Heels (Ft. Jazmine Sullivan)",
                "lyrics": "https://genius.com/Anderson-paak-good-heels-lyrics",
                "desc": "With the first third of the track being a building of the instrumental without a single spoken word, this track suffers a lot from its unfortunate placement. The previous track was a lyrical anomaly and potentially one of .Paak’s better verses of his career. Despite this track having a rather hilarious premise, the instrumental doesn’t pop through any unique outlets and with the next track having a similar instrumental building structure with a better execution, it kills a lot of the momentum gained through the previous track. Even with its poor placement doing it no favors, this track is one of the weaker ones on this album in isolation. Still, .Paak’s solution to the problem presented on this track makes this track worth at least a single listen and if its placement on the album was shifted, it could have sounded a bit more fitting.",
                "extra": "avoid"
            },
            "song6": {
                "name": "Yada Yada",
                "lyrics": "https://genius.com/Anderson-paak-yada-yada-lyrics",
                "desc": "Built in a similar fashion to the previous track, “Yada Yada” spends the introduction of the track building the instrumental piece by piece while featuring more light-hearted subject matter. Featuring two tracks that have instrumentally focused introductions back to back kind of crushes a lot of momentum and energy built by the rest of the album, but “Yada Yada” replenishes some of that by the end of the track. With an instrumental that is easy to vibe to once it all comes together and a pair of strong verses to round out the track at the end, this song ends powerfully."
            },
            "song7": {
                "name": "King James",
                "lyrics": "https://genius.com/Anderson-paak-king-james-lyrics",
                "desc": "As the album’s lead single, this track brought a lot of hope to crestfallen Anderson .Paak fans after the release of the more rap-heavy Oxnard for a return to his roots in more soul oriented music. The bass guitar on this track sounds downright sexy and the saxophone solo towards the latter half of the track is reminiscent of the trumpet solo from “Am I Wrong?” off of Malibu. .Paak’s verses cover some intense subject matter, in stark contrast to the previous two humorous tracks, by addressing police brutality, Kaepernick’s kneeling scandal, and honoring what Lebron James has done to give back to his community among subjects touched on. The chorus is catchy even with its repetition, and the production matches the mood of the track well. Overall, one of the best tracks off the album and a great choice to build excitement for the project.",
                "extra": "standout"
            },
            "song8": {
                "name": "Chosen One (feat. Sonyae Elise)",
                "lyrics": "https://genius.com/Anderson-paak-chosen-one-lyrics",
                "desc": "Capitalizing on the energy built by the previous track, this song keeps that momentum going by starting off funky and fast. The chorus is upbeat with a quick yet intricate delivery by .Paak and a fitting post-chorus that sounds just right on a beat like this. The beat switch is executed incredibly well while preserving the energy of the first half and despite containing only one verse, that one verse is another highlight of the album. .Paak pays homage to former Stones Throw labelmate MF DOOM with the exceptional bars “Heard your fans want to keep you in the underground, cool / When I blow up, said I did it for MF DOOM / No cap, no cap” on said lone verse before the outro. One of the only complaints that could be said of this track is the outro running a little long, but aside from that, this track features two extraordinary beats, a complex chorus and a great verse from .Paak.",
                "extra": "standout"
            },
            "song9": {
                "name": "Jet Black (feat. Brandy)",
                "lyrics": "https://genius.com/Anderson-paak-jet-black-lyrics",
                "desc": "Immediately, as the beat is introduced, the listener is transported back to the highlights of Malibu. This track feels like it could fit almost undetectably into Malibu, and it is hard not to unconsciously reminisce and compare it to that project’s better tracks. The beat is groovy and seductive and .Paak’s voice sounds almost sensual with his delivery of the pre-chorus and chorus. With Dr. Dre behind mixing on this track, perfection is to be expected and he does not hesitate to deliver. The vocals sound phenomenal when tied into the sexy instrumental, and the part of  the chorus sang and harmonized by Brandy sounds magnificent. Finally, the instrumental outro highlighting the piano and the funky bass guitar sounds incredibly infectious to the point that it’s almost hard for the listener to not get seized by the beat. This track is a rush of pure pleasure to listen to and is a wonderful addition to Anderson .Paak’s already massive discography of amazing tracks.",
                "extra": "standout"
            },
            "song10": {
                "name": "Twilight",
                "lyrics": "https://genius.com/Anderson-paak-twilight-lyrics",
                "desc": "With an almost iconic bassline, the production on this song screams Pharrell instantly. This track sounds slick and jazzy at Pharrell’s signature hands, and the looping horns are a charming touch. Unfortunately, this track doesn’t do much to stand out on an album of charming and smooth beats and Anderson .Paak doesn’t have any particularly interesting choruses or verses on this song. This song remains largely unremarkable, which again isn’t necessarily a bad thing, but sounds a lot like a filler track and doesn’t really contribute much on this project as a whole."
            },
            "song11": {
                "name": "What Can We Do? (feat. Nate Dogg)",
                "lyrics": "https://genius.com/Anderson-paak-what-can-we-do-lyrics",
                "desc": "Similar to Kendrick Lamar’s To Pimp A Butterfly, Anderson .Paak chooses to end his album with a feature from an artist who is unfortunately no longer with us. Featuring vocals from the now deceased Nate Dogg, Anderson .Paak synergizes so unbelievably well with these pre-recorded choruses that it has the listener drooling at the thought of what the two could have accomplished if Nate were still with us now. Production-wise, within seconds of this song starting, the sharp plucks of a guitar and the soft pats of a drum build an atmosphere at an astonishing rate. The instrumental almost evokes the feeling of being stranded on the side of the road in the middle of a desert, which ties into the vocals and message of the song nicely. Finally, in typical Anderson .Paak fashion, the outro is an homage and a play on Kendrick Lamar’s outro on To Pimp A Butterfly. .Paak shouts Nate’s name, akin to Kendrick shouting Tupac’s name on “Mortal Man,” as the track fades, however, .Paak is shouting Nate’s name because he cut their recording session short as he tells .Paak to erase the work .Paak just paid for on his way out. Given that Nate is no longer with us, it is almost feel like a send off for the legendary artist and feels like a fitting conclusion for this album.",
                "extra": "standout"
            }
        },
        "summary": "Following the less than desired reception of Oxnard, Ventura feels like a breath of fresh air for Anderson .Paak as he removes the natural rustiness of trying for a new sound. This return to a sound he is familiar with manifests itself in how natural and at ease he sounds on this project. Unfortunately, this project also suffers the consequences of returning to a familiar sound and that is a lack of uniqueness. Some of these tracks suffer from running a little bit too long, and having two back to back instrumental heavy tracks following a wordy track throws the listener for a bit of a loop by killing the momentum built. The weaker tracks on the album suffer from a lack of remarkability, but the best tracks off the album more than make up for them with some of the best verses of Anderson .Paak’s career. Some of these problems could be fixed by trimming some of the more filler tracks and reordering the tracklist, but that would require basically an entire overhaul of the album. Last but not least, for those wondering about the choice of a big toothy grin as this album’s arbitrary rating metric, it was chosen to pay respect to Anderson .Paak’s incredible chompers. .Paak’s upcoming tour is aptly titled the “Best Teef in the Game” tour, and one look at that man’s contagious smile as he’s performing is all the proof anyone needs to give that award to him."
    }
}